{"basics":{"name":"Tianyi Yang","image":"","email":"m0g1c14n [at] gmail [dot] com","url":"https://m0gician.github.io/","summary":"I <s>break</s> study everything language model related. Training, inference, optimization, and deployment.","profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"publications":[{"name":"Raccoon: Prompt Extraction Benchmark of LLM-Integrated Applications","publisher":"Findings of the Association for Computational Linguistics: ACL 2024","releaseDate":"2024","url":"https://aclanthology.org/2024.findings-acl.791/"},{"name":"GMorph: Accelerating Multiple DNN Inference via Cross-Task Computation Reuse","publisher":"Proceedings of the 19th European Conference on Computer Systems","releaseDate":"2024","url":"https://dl.acm.org/doi/10.1145/3627703.3650074/"},{"name":"Event-Event Relation Extraction using Probabilistic Box Embedding","publisher":"Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)","releaseDate":"2022","url":"https://aclanthology.org/2022.acl-short.26/"}],"projects":[{"name":"Unsupervised Mass Product Property Extraction","summary":"Develope a unsupervised pipeline that generates formatted properties for billions of listed goods on Pinduoduo & Temu.","highlights":["Developed a pipeline that converts property templates into finite state machines to guide LLM's decoding, ensuring legal JSON output for all LLM generated product properties","mplemented a unsupervised data cleaning process to filter out duplicates and low quality product properties.","Built a keyword and feature generation process to support billions of products.","Designed a holistic evaluation pipeline for product properties, including format validation, keyword matching, and semantic similarity."],"startDate":"2024-03","endDate":"Present"},{"name":"Red-teaming Benchmark for LLM-Integrated Apps","summary":"Analyze prompt injection attacks, develop compound attack strategies, and propose defense templates to enhance LLM safety through in-context learning","highlights":["Collect 200+ system prompts and instructions from user created ChatGPT based applications on OpenAI's GPT Store.","Summarized state-of-the-art prompt injection paradigms into 10+ categories and further constructed compound attacks.","Derived 20+ prompt templates for in-context defense against prompt injections.","Built Raccoon benchmark to evaluate safety of LLM-integrated applications across models under complex attack scenarios."],"startDate":"2023-09","endDate":"2024-02"},{"name":"DNN Acceleration via Graph Mutation","summary":"Improve DNN inference efficiency for multi-task systems.","highlights":["Led the design and implementation of a parser that converts PyTorch models to intermediate graph representations.","Designed a graph compiler that reuses layers and estimates inference time of new models using sampling.","Designed an algorithm based on simulated annealing to balance exploration and exploitation of graph merging.","Utilized frameworks like TensorRT & TVM to further optimize model inference time."],"startDate":"2022-02","endDate":"2022-10"},{"name":"Learning Joint Event Relations with Boxes","summary":"Ensure logical consistency across narrative events","highlights":["Designed an XML parser and a data loader for extracting labeled relations and improving the overhead of loading data.","Aggregated data with pandas and visualized principal components with existing labels.","Designed and implemented experiments that utilizes Longformer to handle larger text input which exceeds RoBERTa's max token size."],"startDate":"2021-06","endDate":"2022-01"},{"name":"RL Algorithms with High Safety Guarantees","summary":"Safe ML algorithms with mathematical guarantees.","highlights":["Designed and developed machine learning algorithms with high safety constraints using <a href='https://seldonian.cs.umass.edu/Tutorials/overview/'>Seldonian Framework</a>.","Derived concentration inequalities and implemented various Importance Sampling estimators for high confidence policy improvements.","Developed a library for Seldonian Framework with <tt>numpy</tt> and <tt>numba</tt> optimizations.Developed a library for Seldonian Framework with <tt>numpy</tt> and <tt>numba</tt> optimizations.","<a href='https://github.com/M0gician/lightRaven'>Opensourced on GitHub with full documentation.</a>"],"startDate":"2021-06","endDate":"2022-01"}],"work":[{"name":"<b>Pinduoduo</b>","position":"NLP Engineer","startDate":"2024-02","endDate":"Present","summary":"Design production-level LLM application.","highlights":["Implement unsupervised extraction pipeline for mass product properties.","Construct keyword and feature generation process for billions of products.","Build end-to-end system for query-product and product-product relevance learning.","Optimize model inference efficiency via model distillation and quantization."]},{"name":"<b>Amazon Robotics</b>","position":"Software Engineer","startDate":"2022-07","endDate":"2023-3","summary":"Develop next-gen Amazon Grocery Automation System.","highlights":["Designed and implemented AWS cloud infrastructure and algorithms to enable ultra fast 1-2 hour grocery delivery to Amazon customers as part of a new automation pilot program.","Led the design of inventory and order language models.","Designed an event driven MQTT workflow management system utilizing AWS IoT.","Led the test infrastructure design to enable end to end testing of order ingestion to automation fulfillment."]},{"name":"<b>Alibaba DAMO Academy</b>","position":"Research Intern","startDate":"2018-07","endDate":"2018-09","summary":"Research RL-based recommendation systems for Alibaba's online second-hand market <it>Xianyu</it>.","highlights":["Constract the homepage Merchant Feed in <it>Xianyu</it> to a classic Contextual Bandit problem.","Implement a recommendation system based on a modified Linear UCB algorithm which utilizes both browsing features and click features."]}],"education":[{"institution":"University of Massachusetts Amherst","location":"MA, United States","url":"https://www.umass.edu/","area":"Computer Science","studyType":"Master of Science","startDate":"2020-09","endDate":"2022-05"},{"institution":"University of California, Irvine","location":"CA, United States","url":"https://uci.edu/","area":"Computer Science & Engineering, minor in Statistics","studyType":"Bachelor of Science","startDate":"2016-09","endDate":"2020-06"}],"awards":[{"title":"First Prize","date":"2017-09","awarder":"Jamming With Ubuntu 2017 in Rugao"},{"title":"Best TIPPERS program","date":"2017-06","awarder":"UCI IoT Tippers Hackathon"},{"title":"Best Project and Development Practices","date":"2017-04","awarder":"CSULB BeachHacks"}],"languages":[{"language":"Chinese Mandarin","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Spanish","fluency":"Beginner","icon":""}]}