{
  "basics": {
    "name": "Tianyi Yang",
    "image": "",
    "email": "m0g1c14n [at] gmail [dot] com",
    "url": "https://m0gician.github.io/",
    "summary": "I <s>break</s> study everything language model related. Training, inference, optimization, and deployment.",
    "profiles": [
      {
        "network": "Twitter",
        "username": "AlbertEinstein",
        "url": "https://twitter.com/AlbertEinstein"
      }
    ]
  },
  "publications": [
    {
      "name": "Raccoon: Prompt Extraction Benchmark of LLM-Integrated Applications",
      "publisher": "Findings of the Association for Computational Linguistics: ACL 2024",
      "releaseDate": "2024",
      "url": "https://aclanthology.org/2024.findings-acl.791/"
    },
    {
      "name": "GMorph: Accelerating Multiple DNN Inference via Cross-Task Computation Reuse",
      "publisher": "Proceedings of the 19th European Conference on Computer Systems",
      "releaseDate": "2024",
      "url": "https://dl.acm.org/doi/10.1145/3627703.3650074/"
    },
    {
      "name": "Event-Event Relation Extraction using Probabilistic Box Embedding",
      "publisher": "Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers)",
      "releaseDate": "2022",
      "url": "https://aclanthology.org/2022.acl-short.26/"
    }
  ],
  "projects": [
    {
      "name": "Self-Bootstrap LLM Reasoning Behavior",
      "summary": "Develop a scalable, unsupervised training pipeline for fine-grained LLM reasoning behavior tuning.",
      "highlights": [
        "Developed an unsupervised pipeline using LLM-generated task trees to create self-correcting training data for math and puzzle-solving.",
        "Fine-tuned a Qwen2.5 7B base model on the generated dataset to elicit structured, backtracking reasoning.",
        "Used RL with custom reward functions for fine-grained control of the model's reasoning, improving efficiency and explainability.",
        "Achieved 0.79 on MATH-500, 0.52 on AMC, and 0.20 on AIME24, with generalized reasoning behavior and improved self-correction on downstream tasks."
      ],
      "startDate": "2024-08",
      "endDate": "Present"
    },
    {
      "name": "Efficient Offline Data Generation Suite for LLMs",
      "summary": "Create a scalable and efficient data generation suite for LLM workflows, now used as the standard for offline data processing at Pinduoduo.",
      "highlights": [
        "Designed a scalable, efficient data generation suite for large-scale offline processing with LLM-powered workflows.",
        "Implemented a modular, asynchronous architecture for parallelized data preprocessing, request handling, and storage.",
        "Adopted as the standard for offline data generation at Pinduoduo, processing millions of queries weekly across hundreds of millions of products."
      ],
      "startDate": "2025-02",
      "endDate": "Present"
    },
    {
      "name": "Unsupervised Mass Product Property Extraction",
      "summary": "Developed an unsupervised, config-driven pipeline using LLMs to extract diverse product properties for e-commerce.",
      "highlights": [
        "Developed an unsupervised, config-driven pipeline using LLMs to extract diverse product properties.",
        "Used finite-state machines from templates to guide LLM decoding and ensure valid JSON output.",
        "Implemented an unsupervised process to clean and filter low-quality or duplicate properties.",
        "Built a keyword and feature generation process for billions of products.",
        "Designed a holistic evaluation pipeline for property validation, including keyword and semantic checks."
      ],
      "startDate": "2024-02",
      "endDate": "Present"
    },
    {
      "name": "Red-teaming Benchmark for LLM-Integrated Apps",
      "summary": "Analyzed prompt injection attacks and developed the Raccoon benchmark to evaluate the safety of LLM-integrated applications.",
      "highlights": [
        "Collected 200+ system prompts from applications on OpenAI's GPT Store.",
        "Categorized 10+ prompt injection paradigms and constructed compound attacks.",
        "Created 20+ templates for in-context defense against prompt injections.",
        "Built the Raccoon benchmark to evaluate application safety against complex prompt injection attacks."
      ],
      "startDate": "2023-09",
      "endDate": "2024-02"
    },
    {
      "name": "DNN Acceleration via Graph Mutation",
      "summary": "Improved DNN inference efficiency for multi-task systems with a customized graph compiler.",
      "highlights": [
        "Led the design of a parser to convert PyTorch models to an intermediate graph representation.",
        "Designed a graph compiler to reuse layers and estimate inference time via sampling.",
        "Designed a simulated annealing algorithm to optimize graph merging.",
        "Optimized model inference time using TensorRT and TVM."
      ],
      "startDate": "2022-02",
      "endDate": "2022-10"
    },
    {
      "name": "Learning Joint Event Relations with Boxes",
      "summary": "Ensure logical consistency across narrative events",
      "highlights": [
        "Designed an XML parser and a data loader for extracting labeled relations and improving the overhead of loading data.",
        "Aggregated data with pandas and visualized principal components with existing labels.",
        "Designed and implemented experiments that utilizes Longformer to handle larger text input which exceeds RoBERTa's max token size."
      ],
      "startDate": "2021-06",
      "endDate": "2022-01"
    },
    {
      "name": "RL Algorithms with High Safety Guarantees",
      "summary": "Developed safe reinforcement learning algorithms with high-confidence policy improvements using the Seldonian Framework.",
      "highlights": [
        "Supervised by Prof. Philip Thomas, I designed and developed machine learning algorithms with high safety constraints using Seldonian Framework.",
        "Implemented Importance Sampling estimators for high-confidence policy improvements.",
        "Developed a Seldonian Framework library with NumPy and Numba optimizations.",
        "Opensourced on GitHub with full documentation."
      ],
      "startDate": "2020-09",
      "endDate": "2021-02"
    }
  ],
  "work": [
    {
      "name": "<b>Pinduoduo</b>",
      "position": "NLP Engineer",
      "startDate": "2024-02",
      "endDate": "Present",
      "summary": "Lead LLM-integrated applications for e-commerce scenarios.",
      "highlights": [
        "Lead LLM-integrated applications for e-commerce scenarios.",
        "Train and optimize models for latency-critical online tasks.",
        "Design and implement LLM development pipelines to optimize model inference performance."
      ]
    },
    {
      "name": "<b>Amazon Robotics</b>",
      "position": "Software Engineer",
      "startDate": "2022-07",
      "endDate": "2023-3",
      "summary": "Develop the next-generation Amazon Grocery Automation System.",
      "highlights": [
        "Designed and implemented AWS cloud infrastructure and algorithms to enable ultra fast 1-2 hour grocery delivery to Amazon customers as part of a new automation pilot program.",
        "Led the design of inventory and order language models.",
        "Designed an event driven MQTT workflow management system utilizing AWS IoT.",
        "Led the test infrastructure design to enable end to end testing of order ingestion to automation fulfillment."
      ]
    },
    {
      "name": "<b>Alibaba DAMO Academy</b>",
      "position": "Research Intern",
      "startDate": "2018-07",
      "endDate": "2018-09",
      "summary": "Research RL-based recommendation systems for Alibaba's online second-hand market <it>Xianyu</it>.",
      "highlights": [
        "Built the homepage Merchant Feed in <it>Xianyu</it> to a classic Contextual Bandit problem.",
        "Implemented a recommendation system based on a modified Linear UCB algorithm which utilizes both browsing features and click features."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Massachusetts Amherst",
      "location": "MA, United States",
      "url": "https://www.umass.edu/",
      "area": "Computer Science",
      "studyType": "Master of Science",
      "startDate": "2020-09",
      "endDate": "2022-05"
    },
    {
      "institution": "University of California, Irvine",
      "location": "CA, United States",
      "url": "https://uci.edu/",
      "area": "Computer Science & Engineering, minor in Statistics",
      "studyType": "Bachelor of Science",
      "startDate": "2016-09",
      "endDate": "2020-06"
    }
  ],
  "awards": [
    {
      "title": "First Prize",
      "date": "2017-09",
      "awarder": "Jamming With Ubuntu 2017 in Rugao"
    },
    {
      "title": "Best TIPPERS program",
      "date": "2017-06",
      "awarder": "UCI IoT Tippers Hackathon"
    },
    {
      "title": "Best Project and Development Practices",
      "date": "2017-04",
      "awarder": "CSULB BeachHacks"
    }
  ],
  "openSource": [
    {
      "name": "SGLang",
      "summary": "Active contributor: Analyzed DeepSeek V3/R1 inference performance with SGLang optimizations, added support for the Qwen2-57B-A14B model, and improved constrained decoding for Chinese characters.",
      "url": "https://github.com/sgl-project/sglang"
    },
    {
      "name": "Outlines",
      "summary": "Resolved an exception in FSM construction caused by UTF-8 characters starting with a null byte (<code>\\x00</code>).",
      "url": "https://github.com/dottxt-ai/outlines"
    },
    {
      "name": "Numba",
      "summary": "Contributed to fixing a faulty <code>UnicodeCharSeq</code> implementation in Numba.",
      "url": "https://github.com/numba/numba"
    }
  ],
  "languages": [
    {
      "language": "Chinese Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Spanish",
      "fluency": "Beginner",
      "icon": ""
    }
  ]
}
